# Дана цілочислова прямокутна матриця.
# Переставляючи рядки даної матриці, розташувати їх у відповідності з ростом характеристик.
# Характеристикою рядка цілочислової матриці назвемо суму її додатних парних елементів.
import random
import numpy as np
a = []
n = int(input("Введіть кількість рядків матриці : "))
m = int(input("Введіть кількість стовбців матриці : "))
for i in range(n):
    a.append([float(random.randint(-5,15)) for j in range(m)])
a = np.array(a)
print(a)

