# Трикутник задається координатами своїх вершин на площині: A(x1,y1) B(x2,y2),C(x3,y3)
# Визначити, чи є цей трикутник прямокутним.
# AB BC AC -  сторони 3кутника
import math
x1 = float(input('введіть х координату для A ='))
y1 = float(input('введіть y координату для A ='))
x2 = float(input('введіть х координату для B ='))
y2 = float(input('введіть y координату для B ='))
x3 = float(input('введіть x координату для C ='))
y3 = float(input('введіть y координату для C ='))
# знайдемо довжини сторін
AB = math.sqrt((x2-x1)**2+(y2-y1)**2)
BC = math.sqrt((x3-x2)**2+(y3-y2)**2)
AC = math.sqrt((x3-x1)**2+(y3-y1)**2)
# перевіримо через теор. піфагора чи 3кутник прямокутний
if AB**2==BC**2+AC**2 or BC**2==AB**2+AC**2 or AC**2==AB**2+BC**2:
    print('Трикутник прямокутний')
else:
    print('Трикутник не прямокутний')
